src/tests/user-registration.yml
config:
  processor: "../scripts/processor.js"
  phases:
    - name: "Ramp-up Phase"
      duration: 30
      arrivalRate: 0
      rampTo: 50
    - name: "Steady Phase"
      duration: 60
      arrivalRate: 50
    - name: "Ramp-down Phase"
      duration: 30
      arrivalRate: 50
      rampTo: 0
  environments:
    production:
      target: "https://greffchandler.net"
    staging:
      target: "https://staging.greffchandler.net"
scenarios:
  - flow:
      - post:
          url: "/api/auth/tokens/create"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - post:
          url: "/protected/api/registrations/users/register"
          headers:
            Authorization: "Bearer {{ accessToken }}"
            Content-Type: "application/json"
          json:
            displayName: "{{ displayName }}"
            exchangeKeys: "{{ exchangeKeys }}"
          capture:
            - json: "$.id"
              as: "id"
          beforeRequest: generateSignupData
      - delete:
          url: "/protected/api/registrations/users/unregister/{{ id }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"