src/tests/user-searching.yml
config:
  phases:
    - name: "Ramp-up Phase"
      duration: 30
      arrivalRate: 0
      rampTo: 10
    - name: "Steady Phase"
      duration: 60
      arrivalRate: 10
    - name: "Ramp-down Phase"
      duration: 30
      arrivalRate: 10
      rampTo: 0
  environments:
    production:
      target: "https://greffchandler.net"
    staging:
      target: "https://staging.greffchandler.net"
scenarios:
  - flow:
      - get:
          url: "/api/identity/users/search/debora"